////
//// Created by 郝海程 on 2024/3/16.
////
///*
// * 一花一世界，如果把一个程序看做一个世界或一个社会的话，
// * 那么变量就是程序世界的花花草草、万事万物。
// * 即，变量是程序中不可或缺的组成单位，
// * 最基本的存储单元**。*/
//
///*
// * 1 变量构成的三要素:数据类型、变量名、变量值
// *
// * 2 变量的声明格式:
// * 格式1
// *      数据类型 变量名 = 变量值
// * 格式2
// *      数据类型 变量名;
// *      变量名 = 变量值
// * 3 使用变量的注意点:
// *  - C语言中每个变量必须先声明，后使用。
//    - 不同的数据类型，占用的空间大小不一样。
//    - 一旦声明，变量的类型就不能在运行时修改。
// * 4 变量的作用域
// * - 变量的作用域：其定义所在的一对{ }内。
//    - 变量只有在其`作用域`内才有效。出了作用域，变量不可以再被调用。
//    - 同一个作用域内，不能定义重名的变量。
//    - C 语言的变量作用域主要有两种：文件作用域（file scope）和块作用域（block scope）。
// * 5 变量按数据类型的分类
// *      1 基本数据类型
// *            整型
// *                  短整型 short int
// *                  整型  int
// *                  长整型 long
// *            浮点型
// *                  单精度型 float
// *                  双精度型 double
// *            字符型 char
// *
// *      2 构造类型
// *           数组类型
// *           结构体类型 struct
// *           共用体    union
// *           枚举类型   enum
// *      3 指针类型
// *      4 空类型 void
// *      5 后续会学到的类型
// *              整形新增 long long
// *              浮点型 long double
// *              布尔类型 _Bool
// *
// * */
//#include <stdio.h>
//int main() {
////    变量的声明，在同一个作用域内不能命名同名的变量
//    int num_a;
//    int num_b;
////    变量的赋值，第一次赋值即初始化
//    num_a = 100;
//    num_b = 200;
////    合并：变量在声明的同时进行赋值(或初始化)
//    int num_c;
//    int num_d;
//// 变量的使用(必须在变量使用之前对变量进行初始化)
//    num_c=num_a+num_b;
//    printf("num_c = %d\n",num_c);
//    printf("num_d is %d\n",num_d);
////    num_c = 300
////    num_d is -780267520  <--num_d只是声明，却并未赋值，num_d本身有个地址，即指针，没有赋值，即指针没有指向值，即为空指针
////    注意，不能在变量初始化之前使用变量
//return 0;
//
//}
//
////其它函数
////int func(){
////    printf("num1=%d",num1);
////    return 0;
////}
////这里运行会报错，因为num1是main()函数中的局部变量，在{}外不起作用