//
// Created by 郝海程 on 2024/3/19.
//
//字符类型的使用
/*
 * C语言中，使用 char 关键字来表示字符型，用于存储一个`单一字符`。
字符型变量赋值时，需要用一对英文半角格式的单引号（`''`）把字符括起来。
每个字符变量，在16位、32位或64位编译器中都是`占用 1 个字节(=8位)`*/
//#include <stdio.h>
//void main(){
////    setbuf(stdout, NULL);
//    char c1 = 'A';
//    printf_s("%c\n", c1);
//    printf_s("%d\n", c1);
//    char c2 = 66;
//    printf_s("%c\n", c2);
//    char c3 = 48;
//    printf("%c\n",c3);
//    char c4 = 'a';
//    printf("%d\n",c4);
//
//    printf("%d",c4+1);
//
//}
//A
//65  <--A对应的ASCII码
//B <--ANSCII 数字66对应的字符为B
//0 <--48对应的ANSCII为数字0
//97 <--字符a对应的ANSCII码
//98 <-- char类型中的每一个字符都对应着一个anscii码，所以计算时可以将字符和数字进行

//**signed 和 unsigned 修饰：**
//
//根据C90标准，C语言允许在关键字char前面使用signed或unsigned。
//signed char c; // 范围为 -128 到 127
//unsigned char c; // 范围为 0 到 255
//注意，C 语言规定 char 类型默认是否带有正负号，由当前系统决定，这一点与 int 不同， int 等同于 signed int 。这就是说， char 不等同于signed char ，它有可能是 signed char（范围-128 到 127） ，也有可能是 unsigned char （范围0 到255）。不管是哪种，范围都正好都能覆盖 0 到 127 的 ASCII 字符范围。
//
//**表示方式3：使用转义字符**
/*
 *
 * | `\n` | 换行符（光标移动到下行行首）                       |
    | ---- | -------------------------------------------------- |
    | `\t` | 水平制表符，光标移到下一个Tab位置                  |
    | `\'` | 单引号字符 '                                       |
    | `\"` | 双引号字符 "                                       |
    | `\\` | 反斜杠字符 ’\’                                     |
    | `\r` | 回车符，光标移到本行开头                           |
    | `\0` | null 字符，代表没有内容。注意，这个值不等于数字0。 |
    | `\b` | 退格键，光标回退一个字符，但不删除字符             |*/