////
//// Created by 郝海程 on 2024/3/19.
////
///*
// *在C语言编程中，经常需要对不同类型的数据进行运算，
// * 运算前需要先转换为同一类型，再运算。
// * 为了解决数据类型不一致的问题，
// * 需要对数据的类型进行转换。
// *
// *
// *
// */
//#include <stdio.h>
//
//int main() {
////    规则1，隐式类型转换(自动类型转换)
//    short num1 = 10;
////    short 类型宽度小于int 类型，所以可以将short 转为 int 但是反过来不行
//// 即从窄到宽可以，从宽到窄不行
//    int num2 = num1;
//
//    float num3 = 16.55f;
//    double num4 = num3;
//
////    如果是char类型和short类型之间做运算，运算的结果是int 类型
//    char c_1 = 'a';
//    short n_1 = 1;
//    int n_2 = c_1 + n_1;
//    printf("%d\n",n_2);
//
////    宽类型赋值给窄类型
////    `字节宽度较大`的类型，赋值给`字节宽度较小`的变量时，
////    会发生类型降级，自动转为后者的类型。这时可能会发生截值（truncation），
////    系统会自动截去多余的数据位，导致精度损失,
////形式： **(类型名称)(变量、常量或表达式)** 如 (int)x  即将x强制转化为int类型
////
////功能：将“变量、常量或表达式”的运算结果强制转换为“类型名称”所表示的数据类型。
////
////注意：强制类型转换会导致精度损失。
//    double x = 12.3;
//    int y = 10;
//    int z = (int)x + y; //将变量x的值转换成int后,再与y相加
//    printf("z的值为%d",z);
//    float f_1 = 12.3;
//    double d_1 = 12.3;
//    return 0;
//}