//
// Created by 郝海程 on 2024/3/19.
//
//程序运行时，其值不能改变的量，即为`常量`。
//
//C语言中的常量分为以下以下几种：
//
//- 字面常量
//- #define 定义的标识符常量
//- const 修饰的常变量
//- 枚举常量
//
//        举例：字面常量
//
//1、2、12是整型常量，2.1、12.5、3.14是实型常量，'a'、 'b'、'c'是字符型常量。

#include <stdio.h>
//使用#define定义常量 #define 常量名 值
#define a 0
#define pi 3.1415
int main(){
    //字面常量
    3.14;//字面常量
    1000;//字面常量
    printf("a的值为:%d",a);
//    int a = 1;  这样会报错，常量不可以重新赋值
    printf("请输入圆的半径>>");
    float r;
    scanf("%f",&r);
    float s = pi*r*r;
    printf("半径为%f的圆的面积约为%.3f",r,s);
    return 0;

}

/*
 * #### .2.1 使用#define

这种方式是在文件开头用 #define 来定义常量，也叫作“宏定义”。所谓宏定义，**就是用一个标识符来表示一个常量值**，如果在后面的代码中出现了该标识符，那么编译时就全部替换成指定的常量值。即用宏体替换所有宏名，简称`宏替换`。

定义格式：`#define 符号常量名 常量值`

- 符号常量名，称为`宏体`，属于标识符，一般定义时用大写字母表示。
- 常量值，称为`宏名`，可以是数值常量，也可以是字符常量。

习惯上，**宏名用大写字母表示**，以便于与变量区别。但也允许用小写字母。
 *
 * */