////
//// Created by 郝海程 on 2024/3/20.
////
///*
// * 所谓输入输出是以计算机主机为主体而言的。
//    - 输出：从计算机向外部输出设备(显示器、打印机)输出数据。
//    - 输入：从输入设备(键盘、鼠标、扫描仪)向计算机输入数据。
//
//    c语言本身没有提供专门的输入输出语句，所有的输入输出都是由调用标准库函数中的输入输出函数来实现的。
//**输入函数：scanf() 、 getchar()、gets()：**
//
//    - scanf()，是格式输入函数，可接收`任意类型`的数据。
//    - getchar()，是`字符`输入函数， 只能接收`单个字符`。
//    - gets()，是`字符串`输入函数。
//
//**输出函数：printf() 、 putchar()、puts()：**
//
//    - printf()，是格式输出函数，可按指定的格式显示任意类型的数据。
//    - putchar()，`字符`显示函数，只能显示`单个字符`。
//    - puts()，是`字符串`输出函数。
// */
//
//
////###scanf()的使用
////
////scanf()函数的作用：把从键盘上输入的数据根据找到的地址存入内存中，即给变量赋值。
////
////格式： `scanf("格式控制字符串",参数地址列表); `
////
////- “格式控制字符串”：约定输入数据的类型和格式，参数的个数必须与变量地址的个数一致。
////- “参数地址列表”：以逗号 “, ”分隔的、`输入数据变量地址`序列。
//
////求三个数的最大值
////#include <stdio.h>
////int main(){
////    int a,b,c;
////    printf("输入三个数，我将帮你选出最大值:");
////    scanf("%d,%d,%d",&a,&b,&c);
////    if(a>b){  //如果a>b
////        if(a>c){ //且a>c
////            printf("%d\n",a); //那么a最大
////        }else{ //否则a<c
////            printf("%d\n",c); //那么c最大
////        }
////    } else{ //否则a<b
////        if(b>c){ //且b>c
////            printf("%d\n",b); //那么b最大
////        }else{ //否则b<c
////            printf("%d\n",c); //那么c最大
////        }
////    }
////
////    return 0;
////}
//
////输入三个数，我将帮你选出最大值:3,56,12
////56
//
//
////求绝对值
////#include <stdio.h>
////int main(){
////    printf("请输入一个数，我将帮你把它转换成绝对值>>>");
////    int num;
////    scanf("%d",&num);
////    int absnum = num;
////    if(num >=0){
////       printf("%d\n",absnum);
////    } else{
////        absnum = -num;
////        printf("%d\n",absnum);
////    }
////
////}
//
////输入多个变量的值，求乘积
////#include <stdio.h>
////int main(){
////    int a,b,c;
////    printf("输入三个数，我将帮你算出乘积:");
////    scanf("%d,%d,%d",&a,&b,&c);
////    printf("%d\n",a*b*c);
////    return 0;
////}
//
//
///*
// * ### getchar()与putchar()的使用
//
//    - getchar()：输入字符数据
//      - 格式：getchar()
//      - 功能：从键盘缓冲区读入一个字符
//
//    - putchar()：输出字符
//      - 格式： putchar(ch)，其中ch是一个字符变量
//      - 功能：从标准输出设备输出一个字符*/
//
//
////#include <stdio.h>
////int main(){
////    char c_1 = 'A';
////    putchar(c_1);
////    char c_2 = getchar();
////    putchar(c_2);
////
////    return 0;
////}
//
///*
// * ### gets()与puts()的使用(超纲)
//
//**puts()：**
//
//在C语言中，puts() 是一个用于输出字符串的标准库函数，
// 其原型定义在 `<stdio.h>` 头文件中。
// `puts()` 函数的作用是将一个以 null 字符（`\0`）结尾的字符串打印到标准输出（通常是控制台）上，
// 并自动添加一个换行符。
// */
//
//#include <stdio.h>
//int main(){
//    puts("hello world");
//    char s_2[20];
//    gets(s_2); //从键盘读入字符串并将字符串保存在str2数组中
//    return 0;
//}