//
// Created by 郝海程 on 2024/3/20.
//

/*
 * - **十进制（decimal）**
      - 数字组成：0-9
      - 进位规则：满十进一
      - C 语言的整数默认都是十进制数

- **二进制（binary）**
  - 数字组成：0-1
  - 进位规则：满二进一，以`0b`或`0B`开头

**八进制（octal）：很少使用**

    - 数字组成：0-7
    - 进位规则：满八进一，以数字`0`开头表示

**十六进制**

    - 数字组成：0-9，a-f
    - 进位规则：满十六进一，以`0x`或`0X`开头表示。此处的 a-f 不区分大小写*/
//#include <stdio.h>
//
//int main() {
//    int n1 = 10;
//    int n2 = 0b10;
//    int n3 = 010; //八进制
//    int n4 = 0x1a;
//    printf("%d,%d,%d,%d", n1, n2, n3, n4);
//    return 0;
//}
//10,2,8,26


/*不同的进制只是整数的书写方法不同，不会对整数的实际存储方式产生影响。不同进制可以混合使用，比如 10 + 015 + 0x20 是一个合法的表达式。

printf() 的进制相关占位符如下：
    - %d ：十进制整数。
    - %o ：八进制整数。
    - %x ：十六进制整数。
    - %#o ：显示前缀 0 的八进制整数。
    - %#x ：显示前缀 0x 的十六进制整数。
    - %#X ：显示前缀 0X 的十六进制整数。*/

//#include <stdio.h>
//int main(){
//    int x = 100;
//    printf("dec = %d\n", x); // 100
//    printf("octal = %o\n", x); // 144
//    printf("hex = %x\n", x); // 64
//    printf("octal = %#o\n", x); // 0144
//    printf("hex = %#x\n", x); // 0x64
//    printf("hex = %#X\n", x); // 0X64
//    return 0;
//}