//
// Created by 郝海程 on 2024/3/23.
//
//一维数组的定义
/*
 *数组通过变量名后加方括号表示，方括号里面是数组可以容纳的成员数量（即长度）。
 * int arr[10];  //数组 arr ，里面包含10个成员，每个成员都是 int 类型
 * #define NUM 10
int arr1[NUM]; <--两种方式，一种宏定义，另一种常规定义*/

//#include <stdio.h>
//int main(){
////    数组类型的定义
//    int arr[10];
////    数组元素的调用:使用角标，合法范围是0-角标-1
//    arr[0]=10; //给数组的第一个元素赋值为10
//    arr[1]=20; //给数组的第二个元素赋值为20
//
////    常见问题:数组角标越界的问题
////是要角标不在合法范围内，都是越界，
//    arr[10] = 30;//指定的长度是10，即角标应该是[0-9]而这里指定为10，即产生了角标越界，会发生错误，但是，在c语言编译中只会报警
//    printf("%d\n",arr[10]);
//
//    return 0;
//}

//关于长度
//数组的字节长度
//sizeof运算符会返回整个数组的字节长度。
//sizeof 返回值的数据类型是 `size_t` ，所以 sizeof(a) / sizeof(a[0]) 的数据类型也是size_t 。在 printf() 里面的占位符，要用 %zd 或 %zu 。
//#include <stdio.h>
//int main(){
//    int arr[10] = {10,20,30,40,50,60,70,80,90};
//    printf("%zd\n",sizeof(arr));
//    return 0;
//}
//40  <--40是怎么来的呢?首先，我们指定数组为int 类型，默认是4字节，而且我们还制定了数组长度为10，那么其总长度就是4*10=40字节


//数组元素的遍历
#include <stdio.h>
int main(){
    int arr[10] = {10,20,30,40,50,60,70,80,90};
    for(int i = 0;i<sizeof(arr)/sizeof(int)-1;i++){ //注意arr[10]是索引不到的，其下标范围是0-9共十个，而arr[10]则是第11个，可并没有第11个，即角标越界
        printf("%d\n",arr[i]);
    }
    return 0;
}