//
// Created by 郝海程 on 2024/3/23.
//
/*数组可以在声明时，使用大括号，同时对每一个成员赋值
 * int arr[5] = {22, 37, 90, 48, 95};
 * 变形形式1：
 * C 语言允许省略方括号里面的数组成员数量，这时根据大括号里面的值的数量，自动确定数组的长度。
 * int arr[3] = {10,20,30};// 等同于int arr[] = {10,20,30};  //数组 arr 的长度，将根据大括号里面的值的数量，确定为 3
 `变形形式2：`对数组部分元素赋初值：如果大括号里面的值，少于数组的成员数量，那么未赋值的成员自动初始化为 0 。

 变形方式3
 将整个数组的每一个成员都设置为零，最简单的方式如下
 int a[100] = {0};
 注意:使用大括号赋值时，大括号里面的值不能多于数组的长度，否则编译时会报错。
 */


//#include <stdio.h>
//int main(){
//    int arr[]={1,2,3,4,5,6,7};
//    int arr_1[15]={0};
//    int arr2[6]={[0]=1,[1]=3,[5]=7};//特定位置赋值，未指定的默认为0
//    for(int i = 0;i<sizeof(arr2)/sizeof(int);i++){
//            printf("[%d:%d]",i,arr2[i]);
//    }
//    return 0;
//}
////[0:1][1:3][2:0][3:0][4:0][5:7]  <--注意观察角标对应的值

//另一种省略写法
//#include <stdio.h>
//int main(){
//    int arr[]={1,[3]=2,[9]=2};//不写角标则默认按指定的最大角标作为长度
//    printf("%zd\n",sizeof(arr));
//    for(int i = 0;i < sizeof(arr)/sizeof(int);i++){
//        printf("[%d:%d]",i,arr[i]);
//    }
//    return 0;
//}
/*40
[0:1][1:0][2:0][3:2][4:0][5:0][6:0][7:0][8:0][9:2]*/

/*
 *
 * C 语言规定，数组变量一旦声明，数组名指向的地址就不可更改。**因为声明数组时，编译器会自动为数组分配内存地址，这个地址与数组名是绑定的，不可更改。
因此，当数组定义后，再用大括号重新赋值，是不允许的。
 */


/*
 *数组声明的时候，数组长度除了使用常量，也可以使用变量或表达式来指定数组的大小。这叫做`变长数组`（variable-length array，简称 VLA）
 *  int n = 10;
    int arr[n];
 * 变长数组的根本特征是数组长度只有`运行时才能确定`。它的好处是程序员不必在开发时，随意为数组指定一个估计的长度，程序可以在运行时为数组分配精确的长度。*/

//方式1
//#include <stdio.h>
//int main(){
//    int i = 10;
//    int arr_1[i];
//    int arr_2[i+5];
//    int arr_3[i+10];
//    printf("%d,%d,%d",sizeof(arr_1),sizeof(arr_2),sizeof(arr_3));
//    return 0;
//}
//40,60,80



//方式2，malloc()
//如果你的编译器版本不支持变长数组，还可以考虑使用动态内存分配（使用`malloc()函数` ）来创建动态大小的数组。

#include <stdio.h>
int main(){
    int length = 5;
    int *arr = (int *)malloc(length * sizeof(int)); //在堆空间开辟的数组空间
    arr[0]=10;
    arr[1]=20;
    printf("%d\n",arr[1]);

//    注意点，使用完动态创建的数组后，一定要回收数组的内存空间,否则会存在内存泄露
    free(arr);
    return 0;
}