//
// Created by 郝海程 on 2024/3/25.
//取值运算符

//指针作为一种特殊的数据类型可以参与运算，
// 但与其他数据类型不同的是，
// 指针的运算都是针对内存中的地址来实现的。

//取址运算符：&
//取址运算符，使用“`&`”符号来表示。作用：`取出指定变量在内存中的地址`，其语法格式如下：
//&变量
/*#include <stdio.h>
int main(){
    int num = 10;
    printf("%p\n",&num);
//000000de5cfffa74  <--取出num变量的地址
//  给指针变量赋值
    int *p1; //创建指针变量p1
    p1 = &num; //让 p1的指针指向了num的地址，即把num的地址赋给了指针变量p1
    printf("%p",p1); //打印输出p1的值，其作为指针变量，存储的值是一个地址，所以要用%p来接收
//000000de5cfffa74  《--可见其存储的确实是num变量的地址
    return 0;
}*/

/*1、指针变量中只能存放地址（指针），不要将一个整数（或任何其它非地址类型的数据）赋给一个指针变量。

2、C语言中的地址包括位置信息(内存编号，或称纯地址)和它所指向的数据的类型信息，即它是“`带类型的地址`”。所以，一个指针变量只能指向同一个类型的变量，不能抛开类型随意赋值。
        - char* 类型的指针是为了存放 char 类型变量的地址。
        - short* 类型的指针是为了存放 short 类型变量的地址。
        - int* 类型的指针是为了存放 int 类型变量的地址。

3、在没有对指针变量赋值时，指针变量的值是不确定的，可能系统会分配一个未知的地址，此时使用此指针变量可能会导致不可预料的后果甚至是系统崩溃。为了避免这个问题，通常给指针变量赋初始值为0(或NULL)，并把值为0的指针变量称为`空指针变量`。*/

//例子
//#include <stdio.h>
//int main(){
//    int i = 10;
//    int *p1 = &i;  //把i的地址赋给指针变量p1
//    int *p2 = p1;  //把指针变量p1的值（存放的是i的地址）赋给指针变量p2
//    printf("%p\n",&i); //输出i的地址
//    printf("%p\n", p1); //输出p1的值
//    printf("%p\n",p2); //输出p2的值
////    00000005d57ffb6c
////    00000005d57ffb6c
////    00000005d57ffb6c
//    return 0;
//}

//例4：通过指针变量修改指向的内存中的数据
#include <stdio.h>
int main(){
    int i = 100;
    printf("%d\n",i);
    int *p1 = &i;  //把i的地址赋给指针变量p1
    scanf("%d", p1);//相当于scanf("%d",&i);
    printf("%d\n",i);
    return 0;
}