//
// Created by 郝海程 on 2024/3/25.
//取值运算符
/*
 * 在C语言中针对指针运算还提供了一个取值运算符，使用“`*`”符号表示。其`作用与&相反`，根据一个给定的内存地址取出该地址对应变量的值。也称为`解引用符号`。
 * 其格式如下：
        *指针表达式
> `&` 运算符与 `*` 运算符互为逆运算，下面的表达式总是成立：
>
> ```c
> int i = 5;
> if (i == *(&i)) // 正确
> ```



*/

//#include <stdio.h>
//
//int main()
//{
//    int a = 10;
//    printf("%p\n",&a);//打印a的地址
//    int *p = &a; //创建一个指针变量p让其指向a的地址
//    printf("%p\n",p);//打印p的地址
//    printf("%d\n",*p);//打印p的值
//    printf("%d\n",*&a);//打印指针a的值 ，相当于printf("%d",a)
////00000035481ff704
////00000035481ff704
////10
////10
//    return 0;
//}

//例3：通过指针变量修改指向内存地址位置上的值
/*
#include <stdio.h>
int main(){
    int num = 10;
    int *p = &num;
    *p = 20; //注意取值运算,这里即将20赋给p指针变量对应的值
    printf("%d\n",num);
    char ch = 'w';
    char *pc = &ch;
    *pc = 's';
    printf("%c\n",ch);
    return 0;
}
 */
//20
//s

//例4：
//
//定义指针变量 p1、p2，默认各自指向整数a、b，a、b从键盘输入。设计程序，使得 p1 指向其中的较大值，p2 指向其中的较小值 。

#include <stdio.h>
int main(){
    int a , b; //创建两个整形变量a,b
    scanf("%d,%d",&a,&b); //扫描输入
    int *p1; //创建指针变量p1
    int *p2; //创建指针变量p2
    if(a>b){ //如果a>b
        p1 = &a; //把a的地址赋给指针变量p1,即相当于int *p1 =&a
        p2 = &b; //把b的地址赋给指针变量p2,即相当于int *p2 =&b
    } else { //否则
        p1 = &b; //把b的地址赋给指针变量p1,即相当于int *p1 =&b
        p2 = &a; //把a的地址赋给指针变量p2,即相当于int *p2 =&a
    }
    printf("%d\n",*p1);
    printf("%d\n",*p2);
    return 0;
}