//
// Created by 郝海程 on 2024/3/25.
//指针的常用运算
/*
 *
 * 指针本质上就是一个无符号整数，代表了内存地址。除了上面提到的取址运算外，指针还可以与整数加减、自增自减、
 * 同类指针相减运算等。但是规则并不是整数运算的规则。
 *
 *
 * #### 指针与整数值的加减运算

        格式：`指针±整数`

        指针与整数值的加减运算，表示指针所指向的内存地址的移动（加，向后移动；减，向前移动）。指针移动的单位，与指针指向的数据类型有关。**数据类型占据多少个字节，每单位就移动多少个字节。**

        通过此操作，可以快速定位你要的地址。
        */

/*#include <stdio.h>
int main(){
    short *s;
    s = (short *) 0x1234;
    printf("%hx\n", s + 1); //0x1236   复习：%hx ：十六进制 short int 类型
    printf("%hx\n", s - 1); //0x1232
//说明：s + 1 表示指针向内存地址的高位移动一个单位，而一个单位的 short 类型占据两个字节的宽度，
// 所以相当于向高位移动两个字节。
    int *i;
    i = (int *) 0x1234;
    printf("%x\n", i + 1); //0x1238    复习：%x ：十六进制整数
    return 0;
//    说明：指针p+1并不是地址+1，而是指针p指向数组中的下一个数据。比如，int *p，p+1表示当前地址+4，指向下一个整型数据。
}*/

//例1：
/*
#include <stdio.h>
int main(){
    int arr[5] = {1, 2, 3, 6, 5};
    int *p = &arr[2];
    printf("value:%d,position:%p\n",*p,p);
//    value:3,position:000000d7d5fffd18
//注意：只有指向连续的同类型数据区域，指针加、减整数才有实际意义。
    printf("value+1=%d,position+1=%p",*(p+1),p+1);
//    value+1=6,position+1=000000d7d5fffd1c  <--可见取值运算中p往前一位变为arr[3]的值6，地址也是加上了4字节，因为对应的是int类型，连续空间两个空间之间差4字节
    return 0;
}*/

//遍历数组操作
#include <stdio.h>
int main(){
    int arr[5] = {1, 2, 3, 6, 5};
//    创建指针，通过指针变量的加减来访问数组中的值
    int *p = &arr[0];
    for(int i =0;i<5;i++){
        printf("%d",*(p+i));//12365 <--输出成功
    }
    return 0;
}
