//
// Created by 郝海程 on 2024/3/26.
//数组指针和指针数组
//数组指针是指针，指针数组是数组
/*
 * 数组指针:
 * 当指针变量里存放一个数组的首地址时，此指针变量称为指向数组的指针变量，简称`数组指针`。
 * 例如
 *   整形指针 int *p;
 *   浮点型指针 float *p;
 *
 * 指针数组:
 * 数组是用来存放一系列相同类型的数据，
 * 当然数组也可以用来存放指针，这种用来`存放指针的数组`被称为指针数组，它要求存放在数组中指针的`数据类型必须一致`。
 *指针数组-->是存放指针的数组
 * 格式 ：数据类型 *指针数组名[大小];
 * 举例 :
 *    int *arr[5];  <--这样就定义了一个指针数组，每个元素都是一个整形指针即 int *
 * */

#include <stdio.h>


//例1
/*
int main(){
//    举例
    int a, b, c, d, e;
    a = 1;
    b = 2;
    c = 3;
    d = 4;
    e = 5;
//    创建指针数组arr,存放的是a,b,c,d,e五个元素的地址
    int *arr[] = {&a, &b, &c, &d, &e};//定义一个int类型的指针数组

    for(int i = 0;i < 5;i++){
        printf("%d ",*arr[i]); //这样是输出arr内的元素指针的对应取值
    }


    return 0;
}*/


//例2
#include <stdio.h>

int main() {
    int line1[] = {1, 2, 3, 4};         //声明数组，矩阵的第一行
    int line2[] = {5, 6, 7, 8};         //声明数组，矩阵的第二行
    int line3[] = {9, 10, 11, 12};         //声明数组，矩阵的第三行
    int *p_line[3];              //声明整型指针数组
//    
    p_line[0] = line1;           //初始化指针数组元素
    p_line[1] = line2;
    p_line[2] = line3;
    printf("矩阵:\n");
    for (int i = 0; i < 3; i++) {    //外层for循环用来遍历指针数组的  //对指针数组元素循环

        for (int j = 0; j < 4; j++) {  //内层for循环用来遍历line1\line2\line3中的元素  //对矩阵每一列循环
            printf("%d\t", p_line[i][j]); //或改为printf("%d\t", *(p_line[i] + j));
        }
        printf("\n");
    }
    return 0;
}
