//
// Created by 郝海程 on 2024/3/26.
//

/*
#include <stdio.h>
int main(){
    int a[3][4] = {{1, 2,  3,  4},
                   {5, 6,  7,  8},
                   {9, 10, 11, 12}};
    int *p=a;//将a[0]的地址赋予指针变量p

    return 0;
}*/
//上面运行时不会报错，但是打开message会有如下信息
// warning: initialization of 'int *' from incompatible pointer type 'int (*)[4]' [-Wincompatible-pointer-types]
//   10 |     int *p=a;//将a[0]的地址赋予指针变量p

//为什么int *p = a的赋值方式不合适?
//因为p是指向int类型的变量或常量的地址
// a代表a[0]的地址,a[0]的类型不是int类型,而是int[4]类型
// 因为类型不同，所以不建议赋值
//那么应该如何赋值呢?




/*
 * 拓展：指向固定长度数组的指针变量

定义一个整型指针变量指向一维数组，一维数组的每个元素包含 m 个元素。
 定义格式：
      数据类型 (*标识符)[一维数组元素个数];
      例如：定义一个指针变量 p，它指向包含有 4 个元素的一维数组。
        int (*p)[4];
        说明：p先和*结合，说明p是一个指针变量，指向一个大小为4的整型数组。

注意：此时定义的是一个指针变量，并非是一个指针数组。(*p 必须放在括弧内，否则就变成了定义指针数组。)

 */
#include <stdio.h>

int main()
{
//    int a[3][4] = {{1, 2,  3,  4},
//                   {5, 6,  7,  8},
//                   {9, 10, 11, 12}};
//    int (*p)[4] = a; //此时的赋值操作是准确的，此时a[0]与p的类型是相同的
//
//    printf("%p\n",a);//获取a[0]的地址
//    printf("%p\n",p);//获取p的地址,即a[0]的地址
//
//    printf("%p\n",a+1);//获取a[1]的地址,即行标索引为1即第二行的地址
//    printf("%p\n",p+1);//获取p+1的地址,即a[1]的地址
//
//    printf("%p\n",*(p+1));//获取行索引为1即第二行元素的第索引0即第一列，整体上看是第二行第一列即数字5的地址
//    printf("%p\n",*(p+1)+1);//获取行索引为1即第二行元素的第索引1即第二列，整体上看是第二行第二列即数字6的地址
//
//    printf("%d\n", *(*(p+1)));//获取行索引为1即第二行元素的第索引0即第一列，整体上看是第二行第一列即数字5的地址的值
//    printf("%d\n",*(*(p+1)+1));//获取行索引为1即第二行元素的第索引1即第二列，整体上看是第二行第二列即数字6的地址
//000000df3b7ff9c0
//000000df3b7ff9c0
//000000df3b7ff9d0
//000000df3b7ff9d0
//000000df3b7ff9d0
//000000df3b7ff9d4
//5
//6
    int arr[3][4] = {{1, 2,  3,  4},
                     {5, 6,  7,  8},
                     {9, 10, 11, 12}};
    int (*q)[4];
    q = arr;

    printf("arr[0]的地址为：%p\n", arr);            //0000006460dffb40
    printf("arr[0]的地址为：%p\n", q);              //0000006460dffb40
    printf("arr[0][1]的地址为：%p\n", *arr + 1);    //0000006460dffb44
    printf("arr[0][1]的地址为：%p\n", *q + 1);      //0000006460dffb44
    printf("arr[0][1]的地址为：%p\n", arr[0] + 1);  //0000006460dffb44
    printf("arr[0][1]的地址为：%p\n", q[0] + 1);    //0000006460dffb44

    printf("arr[1]的地址为：%p\n", arr + 1);       //0000006460dffb50
    printf("arr[1]的地址为：%p\n", q + 1);         //0000006460dffb50

    printf("arr[1][0]的值为：%d\n", *(*(arr + 1))); //5
    printf("arr[1][0]的值为：%d\n", *(*(q + 1)));   //5
    printf("arr[1][1]的值为：%d\n ", *(*(q + 1) + 1));//6

    //遍历arr[0]中的几个元素
    for (int i = 0; i < 3; i++)
    {
        for (int j = 0; j < 4; j++)
        {
            printf("%d  ", *(*(q + i) + j)); //输出
        }
        printf("\n");

    }


    return 0;
}
