//
// Created by 郝海程 on 2024/3/20.
//
/*
 * 运算符是一种特殊的符号，用以表示数据的运算、赋值和比较等。

运算符的分类：

- 按照`功能`分为：算术运算符、赋值运算符、比较(或关系)运算符、逻辑运算符、位运算符、条件运算符、sizeof运算符

|        分类        |           运算符            |
| :----------------: | :-------------------------: |
|     算术运算符     | +、-、+、-、*、/、%、++、-- |
|     赋值运算符     |   =、+=、-=、*=、/=、%=等   |
| 比较(或关系)运算符 |    >、>=、<、<=、==、!=     |
|     逻辑运算符     |         &&、\|\|、!         |
|      位运算符      |     &、\|、^、~、<<、>>     |
|     条件运算符     |  (条件表达式)?结果1:结果2   |
|    sizeof运算符    |          sizeof()           |

* 按照`操作数个数`分为：一元运算符（单目运算符）、二元运算符（双目运算符）、三元运算符 （三目运算符）

|           分类            |                  运算符                  |
| :-----------------------: | :--------------------------------------: |
| 一元运算符（单目运算符）  |    正号（+）、负号（-）、++、--、!、~    |
| 二元运算符（双目运算符）  | 除了一元和三元运算符剩下的都是二元运算符 |
| 三元运算符 （三目运算符） |         (条件表达式)?结果1:结果2         |*/

//算数运算符 + - * / % ++ --
//注意 ++x --x  x++  x-- 区别为，前两者是先运算后取值 后两者先取值后运算
//#include <stdio.h>
//
//int main() {
//    int i = 12;
//    int i2 = 20;
//    int i3 = i2/i;
//    printf("%d\n", i3);
//    float x = (float)i2/(float)i;
//    printf("%.2f", x);
//
//    return 0;
//
//}
////1
////1.67
//关于 ++ --

//单独使用，没什么不同
//#include <stdio.h>
//int main(){
//    int i = 12;
////    i++;  //先赋值后运算
////    ++i; //先运算后赋值
//// 注意，++ -- 单独运算时，都表示自增1
//    printf("%d\n", i);
//    return 0;
//}


//复合使用
//
//* 和`其他变量放在一起使用`或者和`输出语句放在一起使用`，`前++`和`后++`就产生了不同。
//#include <stdio.h>
//int main(){
//    int n1 = 10;
//    int n2 = n1++; //先赋值，后运算 即 n2 = n1 ; n+=1
//    printf("%d,%d\n",n1, n2);
//    int n3 = ++n1; //先运算，后赋值 ，即 n3 = n+1
//    printf("%d,%d\n",n1,n3);
//    return 0;
//}
////11,10
////12,12
////同样的 -- 也是一样的逻辑

//小练习
//给出一个整数，要求打印其个位数十位数百位数的值
//#include <stdio.h>
//int main(){
//    printf("请输入一个数，我将帮你拆分个位十位和百位>>");
//    int n;
//    scanf("%d", &n);
//    if(n>100){
//        printf("百位数为:%d\n",n/100);
//        printf("十位数为:%d\n",n%100/10);
//        printf("个位数为:%d\n",n%100%10);
//    } else{
//        if(n>10){
//            printf("十位数为:%d\n",n/10);
//            printf("个位数为:%d\n",n%10);
//        } else{
//            printf("个位数为:%d\n",n);
//        }
//    }
//    return 0;
//}

//**案例2：**为抵抗洪水，战士连续作战89小时，编程计算共多少天零多少小时？
//#include <stdio.h>
//int main(){
//    int n = 89;
//    int day = n/24;
//    int hour = n%24;
//    printf("%d天%d小时\n",day,hour);
//    return 0;
//}