//
// Created by 郝海程 on 2024/3/20.
//
//赋值运算符
/*
 * - 符号 =
   - 当“=”两侧数据类型不一致时，可以使用自动类型转换或使用强制类型转换原则进行处理。
   - 支持`连续赋值`。
   - 扩展赋值运算符： +=、 -=、*=、 /=、%=
 */

#include <stdio.h>

//int main() {
//    //连续赋值的测试
////以前的写法
//    int a1 = 10;
//    int b1 = 10;
//
////连续赋值的写法
//    int a2, b2;
//    a2 = b2 = 10;
//
//    int a3 = 10, b3 = 20;
//    int i = 10;
//    i += 3; //等同于 i = i + 3
//    i -= 8;//等同于 i = i - 8
//    i *= 9;//等同于 i = i * 9
//    i /= 2; //等同于 i = i / 2
//    i %= 5;//等同于 i = i % 5
//
//    return 0;
//}

//现有变量m,n请交换m,n的值
//#include <stdio.h>
//
//int main() {
//    int m = 10;
//    int n = 20;
//    int temp;
//    temp = m;
//    m = n;
//    n = temp;
//    printf("m:%d,n:%d",m,n);
//    return 0;
//}

//含金量题目
//以下程序运行后的输出结果是
//#include <stdio.h>
//int main(){
//    double d;
//    float f;
//    long l;
//    int i;
//    i = f = l = d = 20/3;
//    printf("%d %ld %.1f %.1f\n",i,l,f,d);
//    return 0;
//}
//A．6 6 6.0 6.0
//B．6 6 6.7 6.7
//C．6 6 6.0 6.7
//D．6 6 6.7 6.0

//【答案】A
//
//【解析】赋值运算符是自右向左结合的，所以首先执行d＝20/3＝6，同时i、l、f也全为6，在进行输出时，f和d要保留一位小数，所以答案选A。