//
// Created by 郝海程 on 2024/3/20.
//
/*
 * 常用的比较运算符：

    | 关系运算符 | 含义     | 举例      |
    | ---------- | -------- | --------- |
    | >          | 大于     | num > 10  |
    | >=         | 大于等于 | num >= 10 |
    | <          | 小于     | num < 10  |
    | <=         | 小于等于 | num <= 10 |
    | `==`       | 等于     | num == 10 |
    | !=         | 不等于   | num != 10 |

    - 比较运算的结果只有两个取值，要么是真(非0 表示，默认使用1)，要么是假(0 表示)。
      - 比如， 20 > 12 返回 1 ， 12 > 20 返回 0 。
    - 比较运算符“`==`”不能误写成“`=`”
 */
//比较的结果是布尔类型，1真0假
#include <stdio.h>
int main(){
    int a = 10;
    int b = 20;
    printf("%d\n",a<b);
    printf("%d\n",a>b);
//    注意 == 和 = 的区别
    int c = 0;
    if(c == 0){
        printf("c = 0\n");
    } else{
        printf("c = %d\n",c);
    }
    return 0;
}
//1
//0
