//
// Created by 郝海程 on 2024/3/21.
//
/*
 * 主要有下面三个运算符：

| 逻辑运算符 | 描述     | 功能                 | 举例                              |
| ---------- | -------- | -------------------- | --------------------------------- |
| &&         | 与运算符 | 两个条件都要满足     | num1 >= 10 && num2 >= 20          |
| \|\|       | 或运算符 | 两个条件只需满足其一 | num1 >= 10 \|\| num2 >= 20        |
| !          | 非运算符 | 否定条件             | !(num1 >= 10)（等价于 num1 < 10） |

逻辑运算符提供逻辑判断功能，用于构建更复杂的表达式。

举例：

| a       | b       | a && b  | a \|\| b | !a      |
| ------- | ------- | ------- | -------- | ------- |
| 1（真） | 1（真） | 1（真） | 1（真）  | 0（假） |
| 1（真） | 0（假） | 0（假） | 1（真）  | 0（假） |
| 0（假） | 1（真） | 0（假） | 1（真）  | 1（真） |
| 0（假） | 0（假） | 0（假） | 0（假）  | 1（真） |

> 对于逻辑运算符来说，任何非零值都表示真，零值表示伪。比如， 5 || 0 会返回 1 ， 5 && 0 会返回0 。
 */

//#include <stdio.h>
//int main(){
//    int i = 100;
//    if(i > 1 && i < 4){
//        printf("i > 1 && i < 4\n");
//    }else if(i>6){
//        printf("i > 6\n");
//    }
//    return 0;
//}

//**短路现象**
//
//- &&：a && b
//  - 当 a 为假(或0)时，因为a && b 结果必定为 0，所以不再执行表达式 b
//  - 当 a 为真(非0)时，因为a && b 结果不确定，所以会继续求解表达式b
#include <stdio.h>
int main(){
    int a1,b1;
    a1 = 10;
    b1 = 10;
    if (a1 > 5 && b1++ >0){
        printf("yes\n");
    } else{
        printf("no\n");
    }
    printf("b1 = %d\n",b1);

    int a2,b2;
    a2 = 10;
    b2 = 10;
    if (a2 > 20 && b2++ >0){
        printf("yes\n");
    } else{
        printf("no\n");
    }
    printf("b2 = %d\n",b2);

    return 0;
}
