//
// Created by 郝海程 on 2024/3/30.
// 再谈变量

//局部变量：函数内声明的、函数的形参、代码块内，要求使用前必须显式赋值
//全局变量:如果没有显式初始化，它们会被自动、默认初始化为零或空值，具体取决于数据类型。

//- 局部变量：保存在`栈`中，函数被调用时才动态地为变量分配存储单元。
//- 全局变量：保存在内存的`全局存储区`中，占用静态的存储单元。
/*
#include <stdio.h>
void func1(int i){
    int j = 10;
}
void func2(){
    int i = 10;
    //代码块
    {
        int j = 20; // j的作用域就只在{}内
        printf("%d\n",j);
    }
//    printf("%d\n",j); //在这里就会标红，因为j已经在它的作用域外部了
    printf("%d\n",i); //对于i因为其在自己的作用域内，所以没问题
}
*/

//全局变量 定义在函数外部,可以在函数内部使用
//不多赘述

//如果局部变量和全局变量重名，则按就近原则
#include <stdio.h>

int i = 6;
void testfun(){
    int i =10;
    printf("%d\n",i);
}

int main(){
    testfun();
    return 0;
}
//10 <--输出结果为10，确实是按照就近原则



